# -*- coding: utf-8; fill-column: 79 -*-
#+SETUPFILE: "../include/css-1.org"
#+SETUPFILE: "../include/mathjax.org"
#+TITLE: On the periodic-plus-smooth decomposition of an image, part 4: implementation of the linear operators
#+DATE: [2018-01-22 Mon]
#+LINK: moisan2011   https://doi.org/10.1007/s10851-010-0227-1
#+LINK: sb-blog-second ./On_the_periodic-plus-smooth_decomposition_of_an_image-02.org
#+LINK: sb-blog-prev ./On_the_periodic-plus-smooth_decomposition_of_an_image-03.org
#+LINK: sb-blog-next ./On_the_periodic-plus-smooth_decomposition_of_an_image-05.org
#+LINK: sb-blog-data-dir ./On_the_periodic-plus-smooth_decomposition_of_an_image/
#+PROPERTY: header-args:ipython :session :eval no-export :exports both

In the [[sb-blog-prev:][previous instalment]] of this series, we introduced the linear operators
$Q_1$ and $Q$ that allow to define Moisan's ([[moisan2011:][2011]]) periodic-plus-smooth
decomposition $(p, s)$ of an image $u$ as follows

\begin{equation*}
s=\operatorname*{arg\,min}_v F(v, u)\quad\text{and}\quad p=u-s,
\end{equation*}

with

\begin{equation*}
F(v, u)=\langle v, Q\cdot v\rangle-2\langle v, Q_1\cdot u\rangle
+\langle u, Q_1\cdot u\rangle.
\end{equation*}

In theory, the linear operators $Q_1$ and $Q$ are matrices. However, for
$m\times n$ images, these matrices would be unnecessarily large: $mn\times mn$!
We will therefore adopt here a [[https://en.wikipedia.org/wiki/Matrix-free_methods][matrix-free approach]] for the Python
implementation of these operators. The remainder of this post is organized as
follows. We will first discuss [[linear_operators][linear operators]] in the =scipy.sparse.linalg=
sense. Then, we will implement [[Q1_implementation][the $Q_1$ operator]] and [[Q_implementation][the $Q$ operator]].
Finally, we will [[testing][test our implementation]].

* Testing the implementation <<testing>>

For any image $v$, we should have

\begin{equation*}
\langle v, Q_1\cdot v\rangle=E(v, 0)
\quad\text{and}\quad
\langle v, Q\cdot v\rangle=E(v, 0)+E(0, v)+(\operatorname{mean} v)^2,
\end{equation*}

where the energy $E$ was implemented in [[sb-blog-second:][part 2]] of this series.

#+BEGIN_SRC ipython :results output
  import numpy as np

  np.random.seed(20180125)

  def test_operator_Q1(u):
      expected = energy(u, np.zeros_like(u))
      Q1 = OperatorQ1(*u.shape)
      actual = np.sum(u*Q1._apply(u))
      return actual, expected

  print(test_operator_Q1(np.random.rand(32, 33)))
  print(test_operator_Q1(np.random.rand(33, 32)))

  def test_operator_Q(u):
      zero = np.zeros_like(u)
      expected = energy(u, zero)+energy(zero, u)+np.mean(u)**2
      Q = OperatorQ(*u.shape)
      actual = np.sum(u*Q._apply(u))
      return actual, expected

  print(test_operator_Q(np.random.rand(32, 33)))
  print(test_operator_Q(np.random.rand(33, 32)))
#+END_SRC

#+RESULTS:
: (22.504502162057918, 22.504502162057918)
: (15.127021786181793, 15.127021786181791)
: (720.02484219562473, 720.02484219562484)
: (736.86488847277735, 736.86488847277724)

In the above tests (which should really be implemented as unit tests!), it
should be noted that the seed of the random generator is fixed. This ensures
reproducibility. Also, non-square images were used. This allows for detection
of silly errors, such as rows and columns swapping.

